OdRxDynamicAttribute.getValue
\details
Retrieves value stored in attribute.
\returns
Value stored in attribute.
\details
Retrieves value stored in attribute (non - constant version).
\returns
Value stored in attribute.

OdRxDynamicAttribute.getName
\details
Retrieves the name of the value stored in attribute.
\returns
Name of the value stored in attribute.

OdRxDynamicAttribute.createObject(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdRxValue!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Constructor. Creates an attribute of the OdRxDynamicAttribute type.
\param name [in]  The name of value.
\param value [in]  The value to stored in attribute.
\returns
Smart pointer to a constructed attribute object.